{"data":{"markdownRemark":{"html":"<p>I revamped my blog to be built on Gatsbyjs instead of Jekyll, Everything become cleaner, and faster. In this post I'll explain what are the differences I have touched and why have you to try Gatsbyjs? so let's start.</p>\n<h2>Documentation</h2>\n<p>It's my first time to use Gatsbyjs, I've finished my blog in just two days, it's so easy, the documentation is a great resource to learn what you need in building your gatsby project, code samples is great and the system is easy to learn. Gatsbyjs is based on ReactJS, but if you don't know ReactJS I think basics will help you build great things. In Jekyll Doc isn't a great resource to know everything, although it'll help you build your site but you have to search alot to find how things done.</p>\n<h2>Code Structure</h2>\n<p>I really felt the difference, ReactJS with GraphQL Make a significant difference in revamp, they made me can customize the behaviour and the data structures I wanna get from my pages or posts, something like customizing frontmatter data, the path of posts, words count, time to read with no configurations is so great.\nI don't point to Jekyll doesn't have the previous features, but you have alot to do to use them.</p>\n<p>In Jekyll if you wanna loop through your posts, you have to write your loop in liquid which something i don't like it, but in gatsbyjs you can write it in javascript.</p>\n<p>Using Layouts in Jekyll led me to create modify css files more than almost hundred times :D .</p>\n<h2>Plugins</h2>\n<p>I have found alot of plugins in Gatsbyjs, on the other side gems doesn't help you alot in jekyll.\nRSS for example, in Jekyll you have to use it in xml format, there's no way to use JSON feeds.</p>\n<p>This the first post I've written after revamp and I'm sure the list will go on.</p>","fields":{"slug":"blog/posts/revamp-my-blog-from-jekyll-to-gatsby-and-you-have-to-try/"},"frontmatter":{"date":"March 02, 2019","title":"Revamp my blog from Jekyll to Gatsby, and You have to try","toArabic":true},"timeToRead":1,"wordCount":{"words":312}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"blog/posts/revamp-my-blog-from-jekyll-to-gatsby-and-you-have-to-try/","toArabic":true}}